heidi123-3/easyinput-beatbox/firmware/sdkconfig.defaults
# Target: EasyInput V2.0 / ESP32-S3R8
CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Companion UI talks Web Serial on the same USB-Serial/JTAG pipe as the console.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_USJ_ENABLE_USB_SERIAL_JTAG=y

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Keep USB Serial mostly for host JSON frames (UI ignores non-JSON lines).
CONFIG_LOG_DEFAULT_LEVEL_WARN=y

